cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'aria2'
brew 'awscli'
brew 'colima'
brew 'dnsmasq'
brew 'docker'
brew 'graphviz'
brew 'helm'
brew 'htop'
brew 'imagemagick'
brew 'kind'
brew 'kubebuilder'
brew 'kubectl'
brew 'openssl'
brew 'nvm'
brew 'readline'
brew 'ripgrep'
brew 'parallel'
brew 'pinentry-mac'
brew 'terraform'
brew 'tfenv'
brew 'wireguard-tools'
brew 'wireguard-go'
brew 'xcodes'

# Golang
brew 'go'

# Ruby
brew 'ruby-build'
brew 'rbenv'

# Network utils
brew 'nmap'
brew 'wget'

# Docker stuff
brew 'qemu'
brew 'docker-clean'

# Other VCS tools (Used with go)
brew 'hg'

# GUI Applications
cask 'aws-vault'
cask 'flox'
cask 'flycut'
cask 'github'
cask 'google-chrome'
cask 'openlens'
cask 'notion'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'staruml'
cask 'textual'
cask 'visual-studio-code'
cask 'zoom'
